# Normalised v. unnormalised data

In this Notebook you will compare the processing efficiency of *normalised* and *unnormalised* forms of the same data, from the Movies dataset:
* normalised data: `movie`, `movie_actor`, `movie_country`, `movie_director` and `movie_genre` tables
* unnormalised data: `movie_unnormalised` table created by 'joining' together the above tables.

## Movies dataset
This dataset is derived from the [MovieLens + IMDb/Rotten Tomatoes](http://grouplens.org/datasets/hetrec-2011/) dataset 
made available at the *2nd International Workshop on Information Heterogeneity and Fusion in Recommender Systems* 
([HetRec 2011](http://ir.ii.uam.es/hetrec2011)) at the *5th ACM Conference on Recommender Systems* 
([RecSys 2011](http://recsys.acm.org/2011)). 
It is an extension of the [MovieLens 10M](http://grouplens.org/datasets/movielens/) 
dataset containing additional data from the 
[Internet Movie Database (IMDb)](http://www.imdb.com/) and the [RottenTomatoes (RT)](http://www.rottentomatoes.com/) 
movie review system.

This dataset comprises the following five individual datasets:

`movie (movie_id, title, year, rt_all_critics_rating, rt_top_critics_rating, rt_audience_rating, ml_user_rating)`

Each row records the following data about a particular movie identified by the `movie_id` primary key (PK) column.

column | description
------ | -----------
movie_id  (PK) | movie identifier
title | movie title
year | year of release
rt_all_critics_rating | RottenTomatoes - all critics: average rating
rt_top_critics_rating | RottenTomatoes - top critics: average rating
rt_audience_rating | RottenTomatoes - audience: average rating
ml_user_rating | MovieLens - users: average rating


`movie_actor (movie_id, actor_name, ranking)`

Each movie features one or more actors. Each row records a particular actor featuring in a particular movie 
identified by the `movie_id` and `actor_name` primary key columns.


column | description
------ | -----------
movie_id  (PK) | movie identifier
actor_name  (PK) | actor's name
ranking | position of actor on the movie's cast list

`movie_country (movie_id, country)`

Each movie has one country of origin. Each row records the country of origin of a particular movie 
identified by the `movie_id` primary key column.

column | description
------ | -----------
movie_id  (PK) | movie identifier
country | country of origin

`movie_director (movie_id, director_name)`

Each movie has one director. Each row records the director of a particular movie 
identified by the `movie_id` primary key column.


column | description
------ | -----------
movie_id  (PK) | movie identifier
director_name | director's name

`movie_genre (movie_id, genre)`

Each movie is categorised as belonging to one or more movie genres. Each row records a particular genre that 
categorises a particular movie identified by the `movie_id` and `genre` primary key columns.


column | description
------ | -----------
movie_id  (PK) | movie identifier
genre  (PK) | movie genre

Enable access to the PostgreSQL database engine via [SQL Cell Magic](https://pypi.python.org/pypi/ipython-sql).

In [1]:
%load_ext sql
%sql postgresql://test:test@localhost:5432/tm351test

'Connected: test@tm351test'

Normalised data: create the `movie`, `movie_actor`, `movie_country`, `movie_director` and `movie_genre` tables.

In [2]:
%%sql
DROP TABLE IF EXISTS movie_actor;
DROP TABLE IF EXISTS movie_country;
DROP TABLE IF EXISTS movie_director;
DROP TABLE IF EXISTS movie_genre;
DROP TABLE IF EXISTS movie;

CREATE TABLE movie (
 movie_id INTEGER NOT NULL,
 title VARCHAR(250) NOT NULL,
 year INTEGER NOT NULL,
 rt_all_critics_rating REAL,
 rt_top_critics_rating REAL,
 rt_audience_rating REAL,
 ml_user_rating REAL,
 PRIMARY KEY (movie_id)
);

CREATE TABLE movie_actor (
 movie_id INTEGER NOT NULL,
 actor_name VARCHAR(50) NOT NULL,
 ranking INTEGER NOT NULL,
 PRIMARY KEY (movie_id, actor_name),
 FOREIGN KEY (movie_id) REFERENCES movie(movie_id)
);

CREATE TABLE movie_country (
 movie_id INTEGER NOT NULL,
 country VARCHAR(30) NOT NULL,
 PRIMARY KEY (movie_id),
 FOREIGN KEY (movie_id) REFERENCES movie(movie_id)
);

CREATE TABLE movie_director (
 movie_id INTEGER NOT NULL,
 director_name VARCHAR(50) NOT NULL,
 PRIMARY KEY (movie_id),
 FOREIGN KEY (movie_id) REFERENCES movie(movie_id)
);

CREATE TABLE movie_genre (
 movie_id INTEGER NOT NULL,
 genre VARCHAR(20) NOT NULL,
 PRIMARY KEY (movie_id, genre),
 FOREIGN KEY (movie_id) REFERENCES movie(movie_id)
);

Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

Populate the tables from the Movies dataset using [Psycopg](http://initd.org/psycopg/docs/index.html), 
a PostgreSQL database adapter for Python.

In [3]:
import psycopg2 as pg
import pandas as pd
import pandas.io.sql as psqlg

In [4]:
# open a connection to the PostgreSQL database tm351test
conn = pg.connect(dbname='tm351test', host='localhost', user='test', password='test', port=5432)
# create a cursor
c = conn.cursor()

# populate 'movie' table
io = open('data/movie.dat', 'r')
c.copy_from(io, 'movie')
io.close()
conn.commit()

# populate 'movie_actor' table
io = open('data/movie_actor.dat', 'r')
c.copy_from(io, 'movie_actor')
io.close()
conn.commit()

# populate 'movie_country' table
io = open('data/movie_country.dat', 'r')
c.copy_from(io, 'movie_country')
io.close()
conn.commit()

# populate 'movie_director' table
io = open('data/movie_director.dat', 'r')
c.copy_from(io, 'movie_director')
io.close()
conn.commit()

# populate 'movie_genre' table
io = open('data/movie_genre.dat', 'r')
c.copy_from(io, 'movie_genre')
io.close()
conn.commit()

# close cursor
c.close()
# close database connection
conn.close()

Display the all of the data associated with one particular movie.

In [5]:
%%sql
SELECT *
FROM movie
WHERE movie_id = 807;

1 rows affected.

[(807, 'Rendezvous in Paris (Rendez-vous de Paris, Les)', 1995, 6.8, 6.5, 3.6, 3.3)]

In [6]:
%%sql
SELECT *
FROM movie_actor
WHERE movie_id = 807
ORDER BY ranking;

5 rows affected.

[(807, 'Clara Bellar', 1),
 (807, 'Antoine Basler', 2),
 (807, 'Mathias Megard', 3),
 (807, 'Judith Chancel', 4),
 (807, 'Malcolm Conrath', 5)]

In [7]:
%%sql
SELECT *
FROM movie_country
WHERE movie_id = 807;

1 rows affected.

[(807, 'France')]

In [8]:
%%sql
SELECT *
FROM movie_director
WHERE movie_id = 807;

1 rows affected.

[(807, 'Eric Rohmer')]

In [9]:
%%sql
SELECT *
FROM movie_genre
WHERE movie_id = 807
order by genre;

2 rows affected.

[(807, 'Comedy'), (807, 'Romance')]

Unnormalised data: create the `movie_unnormalised` table by 'joining' together the `movie`, `movie_actor`, 
`movie_country`, `movie_director` and `movie_genre` tables defined above.

In [10]:
%%sql
DROP TABLE IF EXISTS movie_unnormalised;

CREATE TABLE movie_unnormalised AS
  SELECT movie.*, 
         actor_name, ranking, 
         country,
         director_name,
         genre
  FROM (((movie LEFT OUTER JOIN movie_actor    ON movie.movie_id = movie_actor.movie_id)
                LEFT OUTER JOIN movie_country  ON movie.movie_id = movie_country.movie_id)
                LEFT OUTER JOIN movie_director ON movie.movie_id = movie_director.movie_id)
                           JOIN movie_genre    ON movie.movie_id = movie_genre.movie_id;

Done.
484795 rows affected.

[]

Notes:

As identified in Notebook `08.1 Movies dataset`, because the actors, country of origin and director are missing 
for some movies, the `LEFT OUTER JOIN` operations on the `movie_actor`, `movie_country` and `movie_director` tables are 
necessary to ensure that these movies appear in the `movie_unnormalised` table.

Display all of the data associated with the same movie as used above with the normalised data.

In [11]:
%%sql
SELECT *
FROM movie_unnormalised
WHERE movie_id = 807
ORDER BY ranking, genre;

10 rows affected.

[(807, 'Rendezvous in Paris (Rendez-vous de Paris, Les)', 1995, 6.8, 6.5, 3.6, 3.3, 'Clara Bellar', 1, 'France', 'Eric Rohmer', 'Comedy'),
 (807, 'Rendezvous in Paris (Rendez-vous de Paris, Les)', 1995, 6.8, 6.5, 3.6, 3.3, 'Clara Bellar', 1, 'France', 'Eric Rohmer', 'Romance'),
 (807, 'Rendezvous in Paris (Rendez-vous de Paris, Les)', 1995, 6.8, 6.5, 3.6, 3.3, 'Antoine Basler', 2, 'France', 'Eric Rohmer', 'Comedy'),
 (807, 'Rendezvous in Paris (Rendez-vous de Paris, Les)', 1995, 6.8, 6.5, 3.6, 3.3, 'Antoine Basler', 2, 'France', 'Eric Rohmer', 'Romance'),
 (807, 'Rendezvous in Paris (Rendez-vous de Paris, Les)', 1995, 6.8, 6.5, 3.6, 3.3, 'Mathias Megard', 3, 'France', 'Eric Rohmer', 'Comedy'),
 (807, 'Rendezvous in Paris (Rendez-vous de Paris, Les)', 1995, 6.8, 6.5, 3.6, 3.3, 'Mathias Megard', 3, 'France', 'Eric Rohmer', 'Romance'),
 (807, 'Rendezvous in Paris (Rendez-vous de Paris, Les)', 1995, 6.8, 6.5, 3.6, 3.3, 'Judith Chancel', 4, 'France', 'Eric Rohmer', 'Comedy'),
 (807, 'Rendezvous in Paris (Rendez-vous de Paris, Les)', 1995, 6.8, 6.5, 3.6, 3.3, 'Judith Chancel', 4, 'France', 'Eric Rohmer', 'Romance'),
 (807, 'Rendezvous in Paris (Rendez-vous de Paris, Les)', 1995, 6.8, 6.5, 3.6, 3.3, 'Malcolm Conrath', 5, 'France', 'Eric Rohmer', 'Comedy'),
 (807, 'Rendezvous in Paris (Rendez-vous de Paris, Les)', 1995, 6.8, 6.5, 3.6, 3.3, 'Malcolm Conrath', 5, 'France', 'Eric Rohmer', 'Romance')]

Display all of the data associated a particular movie where some of the data is missing (actors).

In [12]:
%%sql
SELECT *
FROM movie_unnormalised
WHERE movie_id = 613
ORDER BY ranking, genre;

2 rows affected.

[(613, 'Jane Eyre', 1996, None, None, None, 3.6, None, None, 'UK', 'Susanna White', 'Drama'),
 (613, 'Jane Eyre', 1996, None, None, None, 3.6, None, None, 'UK', 'Susanna White', 'Romance')]

Check that the *normalised* and *unnormalised* forms of the Movies dataset record the same information by recreating the 
*normalised data* from the *unnormalised data* by using the 'project' operation, then comparing the original data with 
the recreated data.

In [13]:
movie = \
 %sql SELECT * \
      FROM movie \
      ORDER BY movie_id

recreated_movie = \
 %sql SELECT DISTINCT movie_id, title, year, rt_all_critics_rating, rt_top_critics_rating, rt_audience_rating, ml_user_rating \
      FROM movie_unnormalised \
      ORDER BY movie_id
    
movie == recreated_movie

10681 rows affected.
10681 rows affected.

True

In [14]:
movie_actor = \
 %sql SELECT * \
      FROM movie_actor \
      ORDER BY movie_id, actor_name

recreated_movie_actor = \
 %sql SELECT DISTINCT movie_id, actor_name, ranking \
      FROM movie_unnormalised \
      WHERE actor_name IS NOT NULL \
      ORDER BY movie_id, actor_name
    
movie_actor == recreated_movie_actor

231732 rows affected.
231732 rows affected.

True

In [15]:
movie_country = \
 %sql SELECT * \
      FROM movie_country \
      ORDER BY movie_id

recreated_movie_country = \
 %sql SELECT DISTINCT movie_id, country \
      FROM movie_unnormalised \
      WHERE country IS NOT NULL \
      ORDER BY movie_id
    
movie_country == recreated_movie_country

10197 rows affected.
10197 rows affected.

True

In [16]:
movie_director = \
 %sql SELECT * \
      FROM movie_director \
      ORDER BY movie_id

recreated_movie_director = \
 %sql SELECT DISTINCT movie_id, director_name \
      FROM movie_unnormalised \
      WHERE director_name IS NOT NULL \
      ORDER BY movie_id
    
movie_director == recreated_movie_director

10155 rows affected.
10155 rows affected.

True

In [17]:
movie_genre = \
 %sql SELECT * \
      FROM movie_genre \
      ORDER BY movie_id, genre

recreated_movie_genre = \
 %sql SELECT DISTINCT movie_id, genre \
      FROM movie_unnormalised \
      ORDER BY movie_id, genre
    
movie_genre == recreated_movie_genre

21564 rows affected.
21564 rows affected.

True

## Activity

In this activity you will compare the runtime of the same queries executed against the *normalised* and *unnormalised* 
 forms of the Movies data.

When a PostgreSQL `SELECT` statement is prefixed with 
[`EXPLAIN ANALYZE`](http://www.postgresql.org/docs/9.3/static/sql-explain.html), the SQL statement is executed but 
instead of the resultant table being displayed, runtime statistics are displayed instead, with the runtime on the 
last line of the output.

Execute each of the following SQL statements and record the runtime displayed.

In [18]:
# Query 1, normalised data
runtime_statistics=%sql \
 EXPLAIN ANALYZE \
 SELECT COUNT(*) \
 FROM (((movie LEFT OUTER JOIN movie_actor    ON movie.movie_id = movie_actor.movie_id) \
               LEFT OUTER JOIN movie_country  ON movie.movie_id = movie_country.movie_id) \
               LEFT OUTER JOIN movie_director ON movie.movie_id = movie_director.movie_id) \
                          JOIN movie_genre    ON movie.movie_id = movie_genre.movie_id
pd.DataFrame(runtime_statistics).tail(1)

13 rows affected.

                            0
12  Total runtime: 324.727 ms

In [19]:
# Query 1, unnormalised data
runtime_statistics=%sql \
 EXPLAIN ANALYZE \
 SELECT COUNT(*) \
 FROM movie_unnormalised
pd.DataFrame(runtime_statistics).tail(1)

3 rows affected.

                           0
2  Total runtime: 186.941 ms

In [20]:
# Query 2, normalised data
runtime_statistics=%sql \
 EXPLAIN ANALYZE \
 SELECT genre, COUNT(*) \
 FROM (((movie LEFT OUTER JOIN movie_actor    ON movie.movie_id = movie_actor.movie_id) \
               LEFT OUTER JOIN movie_country  ON movie.movie_id = movie_country.movie_id) \
               LEFT OUTER JOIN movie_director ON movie.movie_id = movie_director.movie_id) \
                          JOIN movie_genre    ON movie.movie_id = movie_genre.movie_id \
 GROUP BY genre
pd.DataFrame(runtime_statistics).tail(1)

13 rows affected.

                            0
12  Total runtime: 407.916 ms

In [21]:
# Query 2, unnormalised data
runtime_statistics=%sql \
 EXPLAIN ANALYZE \
 SELECT genre, COUNT(*) \
 FROM movie_unnormalised \
 GROUP BY genre
pd.DataFrame(runtime_statistics).tail(1)

3 rows affected.

                           0
2  Total runtime: 319.231 ms

In [23]:
# Query 3, normalised data
runtime_statistics=%sql \
 EXPLAIN ANALYZE \
 SELECT COUNT(DISTINCT movie.movie_id) \
 FROM (((movie LEFT OUTER JOIN movie_actor    ON movie.movie_id = movie_actor.movie_id) \
               LEFT OUTER JOIN movie_country  ON movie.movie_id = movie_country.movie_id) \
               LEFT OUTER JOIN movie_director ON movie.movie_id = movie_director.movie_id) \
                          JOIN movie_genre    ON movie.movie_id = movie_genre.movie_id \
 WHERE genre = 'Comedy'
pd.DataFrame(runtime_statistics).tail(1)

15 rows affected.

                            0
14  Total runtime: 184.855 ms

In [24]:
# Query 3, unnormalised data
runtime_statistics=%sql \
 EXPLAIN ANALYZE \
 SELECT COUNT(DISTINCT movie_id) \
 FROM movie_unnormalised \
 WHERE genre = 'Comedy'
pd.DataFrame(runtime_statistics).tail(1)

5 rows affected.

                           0
4  Total runtime: 166.510 ms

In [25]:
# Query 4, normalised data
runtime_statistics=%sql \
 EXPLAIN ANALYZE \
 SELECT COUNT(DISTINCT movie.movie_id) \
 FROM (((movie LEFT OUTER JOIN movie_actor    ON movie.movie_id = movie_actor.movie_id) \
               LEFT OUTER JOIN movie_country  ON movie.movie_id = movie_country.movie_id) \
               LEFT OUTER JOIN movie_director ON movie.movie_id = movie_director.movie_id) \
                          JOIN movie_genre    ON movie.movie_id = movie_genre.movie_id \
 WHERE country = 'Tunisia'
pd.DataFrame(runtime_statistics).tail(1)

17 rows affected.

                          0
16  Total runtime: 1.216 ms

In [26]:
# Query 4, unnormalised data
runtime_statistics=%sql \
 EXPLAIN ANALYZE \
 SELECT COUNT(DISTINCT movie_id) \
 FROM movie_unnormalised \
 WHERE country = 'Tunisia'
pd.DataFrame(runtime_statistics).tail(1)

5 rows affected.

                          0
4  Total runtime: 85.441 ms

## Analysis

Our results are given below

query | normalised data | unnormalised data
------|-----------------|------------------
1 | 400.926 | 230.794
2 | 507.609 | 372.906
3 | 117.833 | 166.070
4 |   14.020 | 125.870

Queries 1 and 2 access all the data in the tables. As expected, when the queries are run against the *normalised data* 
their runtimes are longer than when run aginst the *unnormalised data* because of the join operations.

Queries 3 and 4 only access a fraction of the data: only 3703 movies are classified as comedies (Query 3) 
and only 1 movie was made in Tunisia (Query 4). The runtimes are less for the *normalised data* because the query 
optimiser can minimise the join operations to just data about comedies and Tunisia respectively, whereas in the case 
of the *unnormalised data* it will have to access all of the data. You will learn about query processing and optimisation in 
Part 12, Section 5.

## Summary
In this Notebook you have compared the processing efficiency of *normalised* and *unnormalised* forms of the same data.

## What next?
If you are working through this Notebook as part of an inline exercise, return to the module materials now.

If you are working through this set of Notebooks as a whole, move on to `10.5 Multi-value columns`.